In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
import matplotlib.pyplot as plt
%matplotlib inline

## Object Creation

In [ ]:
# create a series

In [5]:
s = pd.Series([1, 3,  5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [13]:
# Creating a DataFrame by passing a numpy array, 
# with a datetime index and labeled columns.

In [14]:
# create a date index
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [8]:
type(dates)

pandas.core.indexes.datetimes.DatetimeIndex

In [19]:
np.random.randn(2, 3)

array([[-0.22683342, -2.05958401, -0.92377798],
       [-1.32965676,  1.26102325, -1.01784085]])

In [12]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01 -1.535505 -0.838312 -0.269913 -0.796839
2013-01-02  0.361849 -1.162556  0.297455 -1.203005
2013-01-03  0.659524 -0.462388  0.278573  1.369405
2013-01-04  1.637374  0.648016 -1.310851  0.190573
2013-01-05 -0.907591 -1.416454 -0.619845 -0.330698
2013-01-06 -1.530082 -0.024555  0.069682 -0.590911

In [22]:
# Creating a DataFrame by passing a dict of objects that can be converted to series-like.

In [23]:
df2 = pd.DataFrame({'A' : 1.,
                    'B' : pd.Timestamp('20130102'),
                    'C' : pd.Series(1, index=list(range(4)),dtype='float32'),
                    'D' : np.array([3] * 4,dtype='int32'),
                    'E' : pd.Categorical(["test","train","test","train"]),
                    'F' : 'foo'
                   })
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [26]:
# check data types of data
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

## Viewing the Data

In [27]:
# See the top & bottom rows of the frame

In [28]:
df.head() # view the top of the dataframe

                   A         B         C         D
2013-01-01 -1.535505 -0.838312 -0.269913 -0.796839
2013-01-02  0.361849 -1.162556  0.297455 -1.203005
2013-01-03  0.659524 -0.462388  0.278573  1.369405
2013-01-04  1.637374  0.648016 -1.310851  0.190573
2013-01-05 -0.907591 -1.416454 -0.619845 -0.330698

In [30]:
df.tail(3) # View the last 3 records in the data frame

                   A         B         C         D
2013-01-04  1.637374  0.648016 -1.310851  0.190573
2013-01-05 -0.907591 -1.416454 -0.619845 -0.330698
2013-01-06 -1.530082 -0.024555  0.069682 -0.590911

In [31]:
# Display the index,columns, and the underlying numpy data

In [33]:
df.index #index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [34]:
df.columns # column names

Index(['A', 'B', 'C', 'D'], dtype='object')

In [35]:
df.values # view the data without column names and the indices

array([[-1.53550515, -0.83831186, -0.26991328, -0.79683877],
       [ 0.36184917, -1.16255627,  0.29745488, -1.20300546],
       [ 0.65952377, -0.46238815,  0.27857253,  1.36940493],
       [ 1.63737364,  0.6480157 , -1.31085141,  0.19057276],
       [-0.90759073, -1.41645423, -0.61984451, -0.33069827],
       [-1.53008153, -0.02455492,  0.06968198, -0.59091125]])

In [36]:
# show a quick statistic summary of your data

In [37]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.219072 -0.542708 -0.259150 -0.226913
std    1.302428  0.765217  0.623438  0.910315
min   -1.535505 -1.416454 -1.310851 -1.203005
25%   -1.374459 -1.081495 -0.532362 -0.745357
50%   -0.272871 -0.650350 -0.100116 -0.460805
75%    0.585105 -0.134013  0.226350  0.060255
max    1.637374  0.648016  0.297455  1.369405

In [38]:
# Transpose the data

In [39]:
df

                   A         B         C         D
2013-01-01 -1.535505 -0.838312 -0.269913 -0.796839
2013-01-02  0.361849 -1.162556  0.297455 -1.203005
2013-01-03  0.659524 -0.462388  0.278573  1.369405
2013-01-04  1.637374  0.648016 -1.310851  0.190573
2013-01-05 -0.907591 -1.416454 -0.619845 -0.330698
2013-01-06 -1.530082 -0.024555  0.069682 -0.590911

In [41]:
df.T # Transponse

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -1.535505    0.361849    0.659524    1.637374   -0.907591   -1.530082
B   -0.838312   -1.162556   -0.462388    0.648016   -1.416454   -0.024555
C   -0.269913    0.297455    0.278573   -1.310851   -0.619845    0.069682
D   -0.796839   -1.203005    1.369405    0.190573   -0.330698   -0.590911

In [42]:
# Sorting by an axis

In [46]:
# sort along axis 0 sorts the rows
# sort along axis 1 sorts the columns
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.796839 -0.269913 -0.838312 -1.535505
2013-01-02 -1.203005  0.297455 -1.162556  0.361849
2013-01-03  1.369405  0.278573 -0.462388  0.659524
2013-01-04  0.190573 -1.310851  0.648016  1.637374
2013-01-05 -0.330698 -0.619845 -1.416454 -0.907591
2013-01-06 -0.590911  0.069682 -0.024555 -1.530082

In [50]:

#Sorting by values
df.sort_values('B', ascending=False)

                   A         B         C         D
2013-01-04  1.637374  0.648016 -1.310851  0.190573
2013-01-06 -1.530082 -0.024555  0.069682 -0.590911
2013-01-03  0.659524 -0.462388  0.278573  1.369405
2013-01-01 -1.535505 -0.838312 -0.269913 -0.796839
2013-01-02  0.361849 -1.162556  0.297455 -1.203005
2013-01-05 -0.907591 -1.416454 -0.619845 -0.330698

## Selection

### Getting

In [51]:
# Selecting a single column, which yields a Series, equivalent to df.A
df['A']

2013-01-01   -1.535505
2013-01-02    0.361849
2013-01-03    0.659524
2013-01-04    1.637374
2013-01-05   -0.907591
2013-01-06   -1.530082
Freq: D, Name: A, dtype: float64

In [53]:
# Selecting via [], which slices the rows
df[0:3]

                   A         B         C         D
2013-01-01 -1.535505 -0.838312 -0.269913 -0.796839
2013-01-02  0.361849 -1.162556  0.297455 -1.203005
2013-01-03  0.659524 -0.462388  0.278573  1.369405

In [54]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  0.361849 -1.162556  0.297455 -1.203005
2013-01-03  0.659524 -0.462388  0.278573  1.369405
2013-01-04  1.637374  0.648016 -1.310851  0.190573

### Selection by Label

In [57]:
df

                   A         B         C         D
2013-01-01 -1.535505 -0.838312 -0.269913 -0.796839
2013-01-02  0.361849 -1.162556  0.297455 -1.203005
2013-01-03  0.659524 -0.462388  0.278573  1.369405
2013-01-04  1.637374  0.648016 -1.310851  0.190573
2013-01-05 -0.907591 -1.416454 -0.619845 -0.330698
2013-01-06 -1.530082 -0.024555  0.069682 -0.590911

In [75]:
type(df)

pandas.core.frame.DataFrame

In [73]:
df.shape

(6, 4)

In [74]:
df.ndim

2

In [58]:
dates[0]

Timestamp('2013-01-01 00:00:00', freq='D')

In [59]:
# For getting a cross section using a label
df.loc[dates[0]] # get the first row

A   -1.535505
B   -0.838312
C   -0.269913
D   -0.796839
Name: 2013-01-01 00:00:00, dtype: float64

In [60]:
# Selecting on a multi-axis by label

In [62]:
df.loc[:, ['A', 'B']] # select all the rows, only columns A and B

                   A         B
2013-01-01 -1.535505 -0.838312
2013-01-02  0.361849 -1.162556
2013-01-03  0.659524 -0.462388
2013-01-04  1.637374  0.648016
2013-01-05 -0.907591 -1.416454
2013-01-06 -1.530082 -0.024555

In [63]:
# Showing label slicing, both endpoints are included

In [64]:
df.loc['20130102':'20130104', ['A', 'B']]

                   A         B
2013-01-02  0.361849 -1.162556
2013-01-03  0.659524 -0.462388
2013-01-04  1.637374  0.648016

In [65]:
# Reduction in the dimensions of the returned object

In [68]:
dim_reduction = df.loc['20130102',['A','B']]

In [69]:
type(dim_reduction)

pandas.core.series.Series

In [70]:
dim_reduction.shape

(2,)

In [72]:
dim_reduction.ndim

1

In [76]:
# For getting a scalar value

In [78]:
df.loc[dates[0], 'A'] # returning data at point (0,0)

-1.5355051530728347

In [79]:
# For getting fast access to a scalar (equiv to the prior method)

In [80]:
df.at[dates[0],'A']

-1.5355051530728347

### Selection by Position

In [81]:
# Select via the position of the passed integers

In [83]:
df.iloc[3] # selects data in the 4th row

A    1.637374
B    0.648016
C   -1.310851
D    0.190573
Name: 2013-01-04 00:00:00, dtype: float64

In [84]:
# By integer slices, acting similar to numpy/python

In [85]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04  1.637374  0.648016
2013-01-05 -0.907591 -1.416454

In [86]:
# For slicing rows explicitly

In [87]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02  0.361849 -1.162556  0.297455 -1.203005
2013-01-03  0.659524 -0.462388  0.278573  1.369405

In [88]:
# For slicing columns explicitly

In [89]:
df.iloc[:,1:3]

                   B         C
2013-01-01 -0.838312 -0.269913
2013-01-02 -1.162556  0.297455
2013-01-03 -0.462388  0.278573
2013-01-04  0.648016 -1.310851
2013-01-05 -1.416454 -0.619845
2013-01-06 -0.024555  0.069682

In [90]:
# For getting a value explicitly

In [91]:
df.iloc[1,1]

-1.162556272471579

In [92]:
# For getting fast access to a scalar (equiv to the prior method)

In [93]:
df.iat[1,1]

-1.162556272471579

### Boolean Indexing

In [94]:
# Using a single column’s values to select data.

In [95]:
df[df.A > 0]

                   A         B         C         D
2013-01-02  0.361849 -1.162556  0.297455 -1.203005
2013-01-03  0.659524 -0.462388  0.278573  1.369405
2013-01-04  1.637374  0.648016 -1.310851  0.190573

In [96]:
# A where operation for getting.

In [97]:
 df[df > 0]

                   A         B         C         D
2013-01-01       NaN       NaN       NaN       NaN
2013-01-02  0.361849       NaN  0.297455       NaN
2013-01-03  0.659524       NaN  0.278573  1.369405
2013-01-04  1.637374  0.648016       NaN  0.190573
2013-01-05       NaN       NaN       NaN       NaN
2013-01-06       NaN       NaN  0.069682       NaN

In [98]:
# Using the isin() method for filtering:

In [99]:
df2 = df.copy()

In [100]:
df2['E'] = ['one', 'one','two','three','four','three']
df2

                   A         B         C         D      E
2013-01-01 -1.535505 -0.838312 -0.269913 -0.796839    one
2013-01-02  0.361849 -1.162556  0.297455 -1.203005    one
2013-01-03  0.659524 -0.462388  0.278573  1.369405    two
2013-01-04  1.637374  0.648016 -1.310851  0.190573  three
2013-01-05 -0.907591 -1.416454 -0.619845 -0.330698   four
2013-01-06 -1.530082 -0.024555  0.069682 -0.590911  three

In [104]:
df2['E'].isin(['two', 'four'])

2013-01-01    False
2013-01-02    False
2013-01-03     True
2013-01-04    False
2013-01-05     True
2013-01-06    False
Freq: D, Name: E, dtype: bool

In [105]:
df2[df2['E'].isin(['two', 'four'])]

                   A         B         C         D     E
2013-01-03  0.659524 -0.462388  0.278573  1.369405   two
2013-01-05 -0.907591 -1.416454 -0.619845 -0.330698  four

### Setting

In [106]:
# Setting a new column automatically aligns the data by the indexes

In [108]:
s1 = pd.Series([1,2,3,4,5,6],index=pd.date_range('20130102',periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [109]:
df['F'] = s1

In [110]:
df

                   A         B         C         D    F
2013-01-01 -1.535505 -0.838312 -0.269913 -0.796839  NaN
2013-01-02  0.361849 -1.162556  0.297455 -1.203005  1.0
2013-01-03  0.659524 -0.462388  0.278573  1.369405  2.0
2013-01-04  1.637374  0.648016 -1.310851  0.190573  3.0
2013-01-05 -0.907591 -1.416454 -0.619845 -0.330698  4.0
2013-01-06 -1.530082 -0.024555  0.069682 -0.590911  5.0

In [111]:
# Setting values by label

In [112]:
df.at[dates[0], 'A'] = 0
df

                   A         B         C         D    F
2013-01-01  0.000000 -0.838312 -0.269913 -0.796839  NaN
2013-01-02  0.361849 -1.162556  0.297455 -1.203005  1.0
2013-01-03  0.659524 -0.462388  0.278573  1.369405  2.0
2013-01-04  1.637374  0.648016 -1.310851  0.190573  3.0
2013-01-05 -0.907591 -1.416454 -0.619845 -0.330698  4.0
2013-01-06 -1.530082 -0.024555  0.069682 -0.590911  5.0

In [113]:
# Setting values by position

In [114]:
df.iat[0,1] = 0
df

                   A         B         C         D    F
2013-01-01  0.000000  0.000000 -0.269913 -0.796839  NaN
2013-01-02  0.361849 -1.162556  0.297455 -1.203005  1.0
2013-01-03  0.659524 -0.462388  0.278573  1.369405  2.0
2013-01-04  1.637374  0.648016 -1.310851  0.190573  3.0
2013-01-05 -0.907591 -1.416454 -0.619845 -0.330698  4.0
2013-01-06 -1.530082 -0.024555  0.069682 -0.590911  5.0

In [115]:
# Setting by assigning with a numpy array

In [117]:
df.loc[:,'D'] = np.array([5] * len(df))
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.269913  5  NaN
2013-01-02  0.361849 -1.162556  0.297455  5  1.0
2013-01-03  0.659524 -0.462388  0.278573  5  2.0
2013-01-04  1.637374  0.648016 -1.310851  5  3.0
2013-01-05 -0.907591 -1.416454 -0.619845  5  4.0
2013-01-06 -1.530082 -0.024555  0.069682  5  5.0

In [118]:
#A where operation with setting.

In [119]:
df2 = df.copy()

In [120]:
df2[df2 > 0] = -df2
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.269913 -5  NaN
2013-01-02 -0.361849 -1.162556 -0.297455 -5 -1.0
2013-01-03 -0.659524 -0.462388 -0.278573 -5 -2.0
2013-01-04 -1.637374 -0.648016 -1.310851 -5 -3.0
2013-01-05 -0.907591 -1.416454 -0.619845 -5 -4.0
2013-01-06 -1.530082 -0.024555 -0.069682 -5 -5.0

### Missing Data

In [121]:
df1 = df.reindex(index=dates[0:4],columns=list(df.columns) + ['E'])
df1

                   A         B         C  D    F   E
2013-01-01  0.000000  0.000000 -0.269913  5  NaN NaN
2013-01-02  0.361849 -1.162556  0.297455  5  1.0 NaN
2013-01-03  0.659524 -0.462388  0.278573  5  2.0 NaN
2013-01-04  1.637374  0.648016 -1.310851  5  3.0 NaN

In [ ]:
# set the first 2 rows to 1 at column E

In [122]:
df1.loc[dates[0]:dates[1],'E'] = 1
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -0.269913  5  NaN  1.0
2013-01-02  0.361849 -1.162556  0.297455  5  1.0  1.0
2013-01-03  0.659524 -0.462388  0.278573  5  2.0  NaN
2013-01-04  1.637374  0.648016 -1.310851  5  3.0  NaN

In [ ]:
# To drop any rows that have missing data.

In [127]:
df1.dropna(how='any')

                   A         B         C  D    F    E
2013-01-02  0.361849 -1.162556  0.297455  5  1.0  1.0

In [125]:
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -0.269913  5  NaN  1.0
2013-01-02  0.361849 -1.162556  0.297455  5  1.0  1.0
2013-01-03  0.659524 -0.462388  0.278573  5  2.0  NaN
2013-01-04  1.637374  0.648016 -1.310851  5  3.0  NaN

In [128]:
# Filling missing data

In [129]:
df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -0.269913  5  5.0  1.0
2013-01-02  0.361849 -1.162556  0.297455  5  1.0  1.0
2013-01-03  0.659524 -0.462388  0.278573  5  2.0  5.0
2013-01-04  1.637374  0.648016 -1.310851  5  3.0  5.0

In [130]:
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -0.269913  5  NaN  1.0
2013-01-02  0.361849 -1.162556  0.297455  5  1.0  1.0
2013-01-03  0.659524 -0.462388  0.278573  5  2.0  NaN
2013-01-04  1.637374  0.648016 -1.310851  5  3.0  NaN

In [131]:
# To get the boolean mask where values are nan

In [132]:
pd.isnull(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

## Operations

In [133]:
# Performing a descriptive statistic

In [134]:
df.mean()

A    0.036846
B   -0.402990
C   -0.259150
D    5.000000
F    3.000000
dtype: float64

In [135]:
# Same operation on the other axis
df.mean(1)

2013-01-01    1.182522
2013-01-02    1.099350
2013-01-03    1.495142
2013-01-04    1.794908
2013-01-05    1.211222
2013-01-06    1.703009
Freq: D, dtype: float64

#### Operating with objects that have different dimensionality and need alignment. In addition, pandas automatically broadcasts along the specified dimension.

In [138]:
s = pd.Series([1,3,5,np.nan,6,8],index=dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [139]:
df.sub(s,axis='index')

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -0.340476 -1.462388 -0.721427  4.0  1.0
2013-01-04 -1.362626 -2.351984 -4.310851  2.0  0.0
2013-01-05 -5.907591 -6.416454 -5.619845  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN